Revit 2027 API
BuiltInFailures.EditingFailures.HiddenBeamsEditingWarning Property
 The beam join being modified contains beam that are not visible. Geometry of visible beams may be affected by hidden beams.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HiddenBeamsEditingWarning { get; }
Public Shared ReadOnly Property HiddenBeamsEditingWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HiddenBeamsEditingWarning {
	FailureDefinitionId^ get ();
}
static member HiddenBeamsEditingWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace